
# საკლასო დავალება

# 1) გამოიყენეთ for loop და დაპრინტეთ Join Goa 20-ჯერ

print("-----------------Classwork 1-------------------")

for i in range(20):  # 0-დან 19-მდე (20 ჯერ)
    print("Join Goa")

print("----------------Classwork 2--------------------")

# 2) for loop მეშვეობით გამოიტანეთ რიცხვები 1-დან 200-მდე

for i in range(1, 201):  # 1-დან 200-მდე
    print(i)


print("---------------Classwork 3---------------------")

# 3) for loop მეშვეობით გამოიტანეთ Hello 100 ჯერ და Hello-ს გვერდზე უნდა იბეჭდებოდეს საიტერაციო ცვლადის მნიშვნელობებიც.

for i in range(1, 101):  # 1-დან 100-მდე
    print(f"Hello {i}")
