# 2) გამოიყენეთ For loop და მისი მეშვეობით დაპრინტეთ მხოლოდ ლუწი რიცხვები
for i in range(1, 101):  # 1-დან 100-მდე
    if i % 2 == 0:  # თუ ნაშთი 2-ით გაყოფისას 0-ია, რიცხვი ლუწია
        print(i)


# 3) გამოიყენეთ For loop და დაბეჭდეთ რიცხვები 20 დან 100-მდე
for i in range(20, 101):  # 20-დან 100-მდე
    print(i)


# 4) გამოიყენეთ For loop და დაბეჭდეთ რიცხვები 0-დან 100-მდე და გვერდზე დაუწერეთ ლუწია თუ კენტია. (ნაშთიანი გაყოფის მეშვეობით)
for i in range(101):  
    if i % 2 == 0:
        print(f"{i} - ლუწია")
    else:
        print(f"{i} - კენტია")